Repository: NUKnightLab/sql-mysteries
Catalog: internationalization/translation_html/locale/*/LC_MESSAGES/*.po
Languages: fr

source: Now that you know how to join tables, you should be able to find the interview transcripts for the two witnesses you identified before. Give it a try!
fr: Maintenant que vous savez comment joindre des tables, vous devriez être en mesure de trouver les transcriptions des entrevues des deux témoins que vous avez identifiés auparavant. Essaiez donc !

source: Go Get 'em!
fr: Allez les chercher!

source: Now you know enough SQL to solve the mystery. You'll need to read the ERD and make some reasonable assumptions, but there's no other syntax that you need!
fr: Vous connaissez maintenant suffisamment SQL pour résoudre le mystère. Vous devrez lire l'ERD et faire des hypothèses raisonnables, mais il n'y a pas d'autre syntaxe dont vous avez besoin!

source: Check your solution
fr: Vérifiez votre solution

source: Credits
fr: Crédits

source: The SQL Murder Mystery was created by
fr: SQL Murder Mystery a été créé par

source: while they were Knight Lab fellows. See the
fr: alors qu'ils étaient membres de Knight Lab. Voir le

source: GitHub repository
fr: repository GitHub

source: for more information.
fr: pour plus d'informations.

source: Adapted and produced for the web by
fr: Adapté et réalisé pour le web par

source: This mystery was inspired by
fr: Cette intrigue a été inspirée par

source: a crime in the neighboring Terminal City.
fr: un crime dans la 'Terminal City' voisine.

source: Web-based SQL is made possible by
fr: Le SQL basé sur le Web est rendu possible par

source: SQL query custom web components created and released to the public domain by Zi Chong Kao, creator of
fr: Composants Web personnalisés de requête SQL créés et publiés dans le domaine public par Zi Chong Kao, créateur de

source: Detective illustration courtesy of
fr: Illustration du détective gracieuse de
