Repository: NUKnightLab/sql-mysteries
Catalog: internationalization/translation_html/locale/*/LC_MESSAGES/*.po
Languages: fr

source: Hello world
fr: Bonjour le monde

source: Can you find out whodunnit?
fr: Trouvez le meurtrier !

source: There's been a Murder in SQL City! The SQL Murder Mystery is designed to be both a self-directed lesson to
fr: Il y a eu un meurtre à SQL City! Le mystère de SQL Murder Mystery est conçu pour être à la fois une leçon autodirigée pour

source: learn SQL concepts and commands and a fun game for experienced SQL users to solve an intriguing crime.
fr: apprendre les concepts et les commandes SQL et un jeu amusant pour les utilisateurs SQL expérimentés pour résoudre un crime intrigant.

source: Walkthrough for SQL Beginners
fr: Procédure pas à pas pour les débutants SQL

source: If you're comfortable with SQL, you can
fr: Si vous êtes à l'aise avec SQL, vous pouvez

source: skip these explanations
fr: sauter ces explications

source: and put your skills to the test! Below we introduce some basic SQL concepts, and just enough detail to solve the murder. If you'd like a more complete introduction to SQL, try
fr: et mettre vos compétences à l'épreuve! Ci-dessous, nous présentons quelques concepts SQL de base et juste assez de détails pour résoudre le meurtre. Si vous souhaitez une introduction plus complète à SQL, essayez de

source: Select Star SQL.
fr: sélectionnez Star SQL.

source: A crime has taken place and the detective needs your help. The detective gave you the crime scene report, but you somehow lost it. You vaguely remember that the crime was a
fr: Un crime a eu lieu et le détective a besoin de votre aide. Le détective vous a donné le rapport sur la scène du crime, mais vous l'avez perdu. Vous vous souvenez vaguement que le crime était un

source: murder
fr: meurtre

source: that occurred sometime on
fr: qui s'est produit le

source: Jan.15, 2018​
fr: 15 Janvier 2018

source: and that it took place in
fr: et qu'il a eu lieu à

source: Start by retrieving the corresponding crime scene report from the police department’s database.
fr: Commencez par récupérer le rapport de la scène de crime correspondant dans la base de données du service de police.

source: All the clues to this mystery are buried in a huge database, and you need to use SQL to navigate through this vast network of information.
fr: Tous les indices de ce mystère sont enfouis dans une énorme base de données et vous devez utiliser SQL pour naviguer dans ce vaste réseau d'informations.

source: Your first step to solving the mystery is to retrieve the corresponding crime scene report from the police department’s database.
fr: La première étape pour résoudre le mystère consiste à récupérer le rapport de scène de crime correspondant dans la base de données du service de police.

source: Below we'll explain from a high level the commands you need to know;
fr: Ci-dessous, nou expliquons d'un point de vu haut niveau les commandes que vous devez connaître ;

source: whenever you are ready, you can start adapting the examples to create your own SQL commands in search of clues --
fr: dès que vous êtes prêt, vous pouvez commencer à adapter les exemples pour créer vos propres commandes SQL à la recherche d'indices,

source: you can run any SQL in any of the code boxes, no matter what was in the box when you started.
fr: vous pouvez exécuter n'importe quelle commande SQL dans n'importe laquelle des fenêtres de code, peu importe ce qui se trouvait dans la boîte lorsque vous avez commencé.

source: Some Definitions
fr: Quelques définitions

source: What is SQL?
fr: Qu'est-ce que le SQL?

source: SQL, which stands for Structured Query Language, is a way to interact with relational databases and tables in a way that allows us humans to glean specific, meaningful information.
fr: SQL, qui signifie Structured Query Language, est un moyen d'interagir avec les bases de données relationnelles et les tables d'une manière qui permet à nous, humains, de glaner des informations spécifiques et significatives.

source: Wait, what is a relational database?
fr: Attendez, qu'est-ce qu'une base de données relationnelle ?

source: There's no single definition for the word
fr: Il n'y a pas de définition unique pour le mot

source: database
fr: base de données

source: In general, databases are systems for managing information.
fr: En général, les bases de données sont des systèmes de gestion de l'information.

source: Databases can have varying amounts of structure imposed on the data.
fr: Les bases de données peuvent avoir des quantités variables de structure imposées aux données.

source: When the data is more structured, it can help people and computers work with the data more efficiently.
fr: Lorsque les données sont plus structurées, cela peut aider les gens et les ordinateurs à travailler avec les données plus efficacement.

source: Relational databases are probably the best known kind of database. At their heart, relational databases are made up of
fr: Les bases de données relationnelles sont probablement le type de base de données le plus connu. Au fond, les bases de données relationnelles sont constituées de

source: , which are a lot like spreadsheets. Each column in the table has a name and a data type (text, number, etc.), and each row in the table is a specific instance of whatever the table is 'about'.
fr: , qui ressemblent beaucoup à des feuilles de calcul. Chaque colonne du tableau a un nom et un type de données (texte, nombre, etc.), et chaque ligne du tableau est une instance spécifique de ce dont la table parle.

source: The 'relational' part comes with specific rules about how to connect data between different tables.
fr: La partie 'relationnelle' est accompagnée de règles spécifiques sur la manière de connecter des données entre différentes tables.

source: What is an ERD ?
fr: Qu'est-ce qu'un ERD ?

source: ERD, which stands for Entity Relationship Diagram, is a visual representation of the relationships among all relevant tables within a database.
fr: ERD, qui signifie Entity Relationship Diagram, est une représentation visuelle des relations entre toutes les tables pertinentes d'une base de données.

source: You can find the ERD for our SQL Murder Mystery database below.
fr: Vous pouvez trouver l'ERD pour notre base de données SQL Murder Mystery ci-dessous.

source: The diagram shows that each table has a name (top of the box, in bold), a list of column names (on the left) and their corresponding data types (on the right, in all caps).
fr: Le diagramme montre que chaque table a un nom (en haut de la boîte, en gras), une liste de noms de colonnes (à gauche) et leurs types de données correspondants (à droite, en majuscules).

source: There are also some gold key icons, blue arrow icons and gray arrows on the ERD.
fr: Il existe également des icônes de clés dorées, des icônes de flèche bleue et des flèches grises sur l'ERD.

source: A gold key indicates that the column is the ​primary key​ of the corresponding table, and a blue arrow indicates that the column is the foreign key​ of the corresponding table.
fr: Une clé dorée indique que la colonne est la clé primaire de la table correspondante et une flèche bleue indique que la colonne est la clé étrangère de la table correspondante.

source: Primary Key​:
fr: Clef primaire :

source: a unique identifier for each row in a table.
fr: un identifiant unique pour chaque ligne d'une table.

source: Foreign Key​:
fr: Clef étrangère :

source: used to reference data in one table to those in another table.
fr: utilisée pour référencer les données d'une table à celles d'une autre table.

source: If two tables are related, the matching columns, i.e. the common identifiers of the two tables, are connected by a gray arrow in the diagram.
fr: Si deux tables sont liées, les colonnes correspondantes, c'est-à-dire les identifiants communs des deux tables, sont reliées par une flèche grise dans le diagramme.

source: Here is the ERD for our database:
fr: Voici l'ERD de notre base de données :

source: What is a query?
fr: Qu'est-ce qu'une requête ?

source: If you were to look at the data in this database, you would see that the tables are huge!
fr: Si vous regardiez les données de cette base de données, vous verriez que les tables sont énormes!

source: There are so many data points; it simply isn’t possible to go through the tables row by row to find the information we need. What are we supposed to do?
fr: Il y a tellement de points de données qu'il n’est tout simplement pas possible de parcourir les tableaux ligne par ligne pour trouver les informations dont nous avons besoin. Que sommes nous sensés faire?

source: This is where queries come in. Queries are statements we construct to get data from the database. Queries read like natural English (for the most part).
fr: C'est là qu'interviennent les requêtes. Les requêtes sont des instructions que nous construisons pour obtenir des données de la base de données. Les requêtes se lisent comme de l'anglais naturel (pour la plupart).

source: Let's try a few queries against our database. For each of the boxes below, click the «run» to «execute» the query in the box.
fr: Essayons quelques requêtes sur notre base de données. Pour chacune des cases ci-dessous, cliquez sur «run» pour «exécuter» la requête dans la case.

source: You can edit the queries right here on the page to explore further. (Note that SQL commands are not case-sensitive, but it's conventional to capitalize them for readability.
fr: Vous pouvez modifier les requêtes ici même sur la page pour explorer davantage. (Notez que les commandes SQL ne sont pas sensibles à la casse, mais il est conventionnel de les mettre en majuscule pour plus de lisibilité.

source: You can also use new lines and white space as you like to format the command for readability.
fr: Vous pouvez également utiliser de nouvelles lignes et un espace blanc comme vous le souhaitez pour formater la commande pour plus de lisibilité.

source: Most database systems require you to end a query with a semicolon (';') although the system for running them in this web page is more forgiving.)
fr: La plupart des systèmes de base de données exigent que vous terminiez une requête par un point-virgule (';') bien que le système pour les exécuter dans cette page Web soit plus indulgent.)

source: What elements does a SQL query have ?
fr: Quels éléments contient une requête SQL ?

source: A SQL query can contain :
fr: Une requête SQL peut contenir :

source: SQL keywords (like the ​SELECT​ and ​FROM​ above)
fr: Mots clés SQL (comme ​SELECT​ et ​FROM​ ci-dessus)

source: Column names (like the ​name​ column above)
fr: Noms de colonne (comme le ​nom​ de la colonne ci-dessus)

source: Table names (like the ​person​ table above)
fr: Noms de table (comme le tableau des ​personnes​ ci-dessus)

source: Wildcard characters (such as
fr: Caractères génériques (tels que

source: Functions
fr: fonctions

source: Specific filtering criteria
fr: Critères de filtrage spécifiques

source: SQL Keywords
fr: Mots clés SQL

source: SQL keywords are used to specify actions in your queries.
fr: Les mots clés SQL sont utilisés pour spécifier des actions dans vos requêtes.

source: SQL keywords are not case sensitive, but we suggest using all caps for SQL keywords so that you can easily set them apart from the rest of the query.
fr: Les mots clés SQL ne sont pas sensibles à la casse, mais nous vous suggérons d'utiliser toutes les majuscules pour les mots clés SQL afin que vous puissiez facilement les distinguer du reste de la requête.

source: Some frequently used keywords are :
fr: Certains mots clés fréquemment utilisés sont :

source: SELECT allows us to grab data for specific columns from the database:
fr: SELECT nous permet de récupérer des données pour des colonnes spécifiques de la base de données :

source: * (asterisk): it is used after ​SELECT​ to grab all columns from the table;
fr: * (astérisque) : il est utilisé après SELECT pour récupérer toutes les colonnes de la table ;

source: column_name(s): to select specific columns, put the names of the columns after SELECT​ and use commas to separate them.
fr: nom_colonne(s) : pour sélectionner des colonnes spécifiques, mettez les noms des colonnes après SELECT et utilisez des virgules pour les séparer.

source: FROM allows us to specify which table(s) we care about; to select multiple tables, list the table names and use commas to separate them.
fr: FROM nous permet de spécifier la ou les tables qui nous intéressent; pour sélectionner plusieurs tables, listez les noms de tables et utilisez des virgules pour les séparer.

source: (But until you learn the JOIN keyword, you may be surprised at what happens. That will come later.)
fr: (Mais tant que vous n'aurez pas appris le mot clé JOIN, vous serez peut-être surpris de ce qui se passe. Cela viendra plus tard.

source: The ​WHERE​ clause in a query is used to filter results by specific criteria.
fr: La clause WHERE dans une requête est utilisée pour filtrer les résultats selon des critères spécifiques.

source: Let's try some of these things.
fr: Essayons certaines de ces choses.

source: The ​AND​ keyword is used to string together multiple filtering criteria so that the filtered results meet each and every one of the criteria.
fr: Le mot clé AND est utilisé pour enchaîner plusieurs critères de filtrage afin que les résultats filtrés répondent à chacun des critères.

source: (There's also an OR keyword, which returns rows that match any of the criteria.)
fr: (Il existe également un mot clé OR, qui renvoie les lignes qui correspondent à l'un des critères.)

source: If you haven't found the right crime scene report yet, click "show solution" above, and replace the contents of the box with just the revealed command. (Leave out the initial
fr: Si vous n'avez pas encore trouvé le bon rapport de scène de crime, cliquez sur "Afficher la solution " ci-dessus et remplacez le contenu de la boîte par la commande révélée. (Oubliez l'initiale

source: If you figured out the query that shows the single crime scene report instead of a few for the same city and type, then congratulations and disregard the word "incorrect". You'll know if you got it!
fr: Si vous avez trouvé la requête qui montre le rapport de scène de crime unique au lieu de quelques-uns pour la même ville et le même type, félicitations et ne tenez pas compte du mot «incorrect». Vous saurez si vous l'avez!

source: Wildcards and other functions for partial matches
fr: Caractères génériques et autres fonctions pour les correspondances partielles

source: Sometimes you only know part of the information you need.
fr: Parfois, vous ne connaissez qu'une partie des informations dont vous avez besoin.

source: SQL can handle that. Special symbols that represent unknown characters are called "wildcards," and SQL supports two. The most common is the
fr: SQL peut gérer cela. Les symboles spéciaux qui représentent des caractères inconnus sont appelés «caractères génériques» et SQL en prend en charge deux. Le plus courant est le

source: wildcard.
fr: joker.

source: When you place a
fr: Lorsque vous placez un

source: wildcard in a query string, the SQL system will return results that match the rest of the string exactly, and have anything (or nothing) where the wildcard is. For example,
fr: caractère générique dans une chaîne de requête, le système SQL retournera des résultats qui correspondent exactement au reste de la chaîne et contiendra n'importe quoi (ou rien) là où se trouve le caractère générique. Par exemple,

source: matches
fr: correspondent

source: and
fr: et

source: California
fr: Californie

source: The other, less commonly used wildcard, is
fr: L'autre caractère générique, moins couramment utilisé, est

source: This one means 'match the rest of the text, as long as there's exactly one character in exactly the position of the
fr: Celui-ci signifie `correspondre au reste du texte, tant qu'il y a exactement un caractère exactement à la position du

source: no matter what it is. So,
fr: peu importe ce que c'est. Alors,

source: would match
fr: correspondrait

source: but not
fr: mais pas

source: or
fr: ou

source: When using wildcards, you don't use the
fr: Lorsque vous utilisez des caractères génériques, vous n'utilisez pas le

source: symbol; instead, you use
fr: symbole; à la place, vous utilisez

source: SQL also supports numeric comparisons like
fr: SQL prend également en charge les comparaisons numériques comme

source: (less than) and
fr: (inférieur à) et

source: (greater than). You can also use the keywords
fr: (plus grand que). Vous pouvez également utiliser les mots-clés

source: and all of those work with words as well as numbers.
fr: et tout cela fonctionne avec des mots aussi bien qu'avec des nombres.

source: We've mentioned that SQL commands are not case-sensitive, but
fr: Nous avons mentionné que les commandes SQL ne sont pas sensibles à la casse, mais les valeurs de requête

source: querie values for
fr: pour

source: are. Sometimes you don't know how the text is stored in the database. SQL provides a couple of functions which can smooth that out for you. They're called
fr: le sont. Parfois, vous ne savez pas comment le texte est stocké dans la base de données. SQL fournit quelques fonctions qui peuvent vous faciliter la tâche. Ils s'appellent

source: and you can probably figure out what they do, especially if you explore in the box below.
fr: et vous pouvez probablement comprendre ce qu'ils font, surtout si vous vous baladez dans l'encadré ci-dessous.

source: SQL Aggregate Functions
fr: Les fonctions d'agrégation SQL

source: Sometimes the questions you want to ask aren’t as simple as finding the row of data that fits a set of criteria.
fr: Parfois, les questions que vous souhaitez poser ne sont pas aussi simples que de trouver la ligne de données correspondant à un ensemble de critères.

source: You may want to ask more complex questions such as “Who is the oldest person?” or “Who is the shortest person?”
fr: Vous voudrez peut-être poser des questions plus complexes telles que «Qui est la personne la plus âgée?» ou «Qui est la personne la plus petite?»

source: Aggregate functions
fr: Fonctions d'agrégation

source: can help you answer these questions. In fact, you learned an aggregate function above,
fr: peut vous aider à répondre à ces questions. En fait, vous avez déjà appris une fonction d'agrégation ci-dessus,

source: How old is the oldest person with a drivers license? With a small amount of data, you might be able to just eyeball it, but there thousands of records in the
fr: Quel âge a la personne la plus âgée avec un permis de conduire? Avec une petite quantité de données, vous pourrez peut-être simplement les observer, mais il existe des milliers d'enregistrements dans la table

source: drivers_license
fr: permis_de_conduire

source: Try
fr: Essayez

source: if you want to know just how many!) You can't just look over that list to find the answer.
fr: si vous voulez savoir combien!) Vous ne pouvez pas simplement parcourir cette liste pour trouver la réponse.

source: Here are a few useful aggregate functions SQL provides:
fr: Voici quelques fonctions d'agrégation utiles fournies par SQL :

source: finds the maximum value
fr: trouve la valeur maximale

source: finds the minimum value
fr: trouve la valeur minimale

source: calculates the sum of the specified column values
fr: calcule la somme des valeurs de colonnes spécifiées

source: calculates the average of the specified column values
fr: calcule la moyenne des valeurs de colonnes spécifiées

source: counts the number of specified column values
fr: compte le nombre de valeurs de colonnes spécifiées

source: There's another way to find minimum and maximum values, while also seeing more of the data.
fr: Il existe une autre façon de trouver les valeurs minimales et maximales, tout en affichant davantage de données.

source: You can control the sort order of results you get. It's really quite intuitive: just use
fr: Vous pouvez contrôler l'ordre de tri des résultats que vous obtenez. C'est vraiment assez intuitif: il suffit d'utiliser

source: followed by a column name. It can be challenging when there's a lot of data!
fr: suivi d'un nom de colonne. Cela peut être difficile quand il y a beaucoup de données!

source: (When people get serious about working with SQL, they use better tools than this web-based system!)
fr: (Lorsque les gens prennent au sérieux le travail avec SQL, ils utilisent de meilleurs outils que ce système Web!)

source: By default, ORDER BY goes in "ascending" (smallest to largest, or A to Z) order, but you can be specific with
fr: Par défaut, ORDER BY passe dans l'ordre "croissant " (du plus petit au plus grand, ou de A à Z), mais vous pouvez être précis avec

source: for ascending, or you can reverse it with
fr: pour monter, ou vous pouvez l'inverser avec

source: By now, you know enough SQL to identify the two witnesses. Give it a try!
fr: A présent, vous connaissez suffisamment SQL pour identifier les deux témoins. Essaiez donc !

source: Making connections
fr: Faire des connexions

source: Joining tables
fr: Joindre des tables

source: Until now, we’ve been asking questions that can be answered by considering data from only a single table.
fr: Jusqu'à présent, nous avons posé des questions auxquelles il est possible de répondre en considérant les données d'un seul tableau.

source: But what if we need to ask more complex questions that simultaneously require data from two different tables?
fr: Mais que se passe-t-il si nous devons poser des questions plus complexes qui nécessitent simultanément des données provenant de deux tables différentes?

source: That’s where ​JOIN​ comes in.
fr: C’est là que JOIN entre en jeu.

source: More experienced SQL folks use a few different kinds of JOIN -- you may hear about INNER, OUTER, LEFT and RIGHT joins.
fr: Les utilisateurs SQL plus expérimentés utilisent différents types de JOIN, vous pouvez entendre parler de jointures INTERNE, EXTERNE, GAUCHE et DROITE.

source: Here, we'll just talk about the most common kind of JOIN, the INNER JOIN.
fr: Ici, nous allons simplement parler du type le plus courant de JOIN, le JOINT INTERNE.

source: Since it's common, you can leave out INNER in your SQL commands.
fr: Comme c'est courant, vous pouvez omettre INTERNE dans vos commandes SQL.

source: The most common way to join tables is using primary key and foreign key columns.
fr: Le moyen le plus courant de joindre des tables consiste à utiliser des colonnes de clés primaires et de clés étrangères.

source: Refer back to the Entity Relationship Diagram (ERD) above if you don't remember what those are, or to see the key relationships between tables in our database.
fr: Reportez-vous au diagramme de relation d'entité (ERD) ci-dessus si vous ne vous souvenez pas de ce que sont ces derniers, ou pour voir les relations clés entre les tables de notre base de données.

source: You can do joins on any columns, but the key columns are optimized for fast results.
fr: Vous pouvez effectuer des jointures sur toutes les colonnes, mais les colonnes clés sont optimisées pour des résultats rapides.

source: It is probably easier to show how joins work with our interactive SQL system than to write them.
fr: Il est probablement plus facile de montrer comment les jointures fonctionnent avec notre système SQL interactif que de les écrire.

source: Sometimes you want to connect more than one table. SQL lets you join as many tables in a query as you like.
fr: Parfois, vous souhaitez connecter plus d'une table. SQL vous permet de joindre autant de tables que vous le souhaitez dans une requête.
